Repository: Softcatala/translation-memory-tools
Catalog: latest-memories/tmx/drupal-tm.tmx
Source language: en
Languages: ca_es

source: If an existing translation package does not meet your needs, the Gettext Portable Object (<em>.po</em>) files within a package may be modified, or new <em>.po</em> files may be created, using a desktop Gettext editor. The Locale module's <a href='@import'>import</a> feature allows the translated strings from a new or modified <em>.po</em> file to be added to your site. The Locale module's <a href='@export'>export</a> feature generates files from your site's translated strings, that can either be shared with others or edited offline by a Gettext translation editor.
ca_es: Si un paquet de traducció existent no reuneix els vostres requeriments, els fitxers Gettext Portable Object (<em>.po</em>) dins d'un paquet es poden modificar, o es poden crear nous fitxers <em>.po</em>, utilitzant un editor Gettext. L'opció d'<a href="@import">importació</a> del mòdul Locale permet afegir al vostre lloc les cadenes traduïdes d'un fitxer <em>.po</em> nou o modificat. L'opció d'<a href="@export">exportació</a> del mòdul genera fitxers amb les cadenes traduïdes del vostre lloc, que poden ser, tant compartits amb d'altres com editats fora de línia amb un editor de traduccions Gettext.

source: Configuring a multilingual site
ca_es: Configuració d'un lloc multilingüe

source: Language negotiation allows your site to automatically change language based on the domain or path used for each request. Users may (optionally) select their preferred language on their <em>My account</em> page, and your site can be configured to honor a web browser's preferred language settings. Site content can be translated using the <a href='@content-help'>Content translation module</a>.
ca_es: La negociació de la llengua permet que el vostre lloc canviï automàticament de llengua en funció del domini o camí utilitzat en cada petició. Els usuaris poden (opcionalment) seleccionar la seva llengua preferida a la seva pàgina <em>El meu compte</em>, i el vostre lloc es pot configurar per adaptar-se a les preferències lingüístiques del navegador. El contingut del lloc pot ser traduït utilitzant el <a href="@content-help">mòdul Content translation</a>.

source: With multiple languages enabled, interface text can be translated, registered users may select their preferred language, and authors can assign a specific language to content. <a href="@translations">Download contributed translations</a> from Drupal.org.
ca_es: Amb diferents llengües activades, el text de la interfície pot ser traduït, els usuaris registrats poden escollir la seva llengua preferida i els autors poden assignar una llengua específica al contingut. <a href="@translations">Descarregueu les traduccions contribuïdes</a> des de Drupal.org.

source: Add a language to be supported by your site. If your desired language is not available in the <em>Language name</em> drop-down, click <em>Custom language</em> and provide a language code and other details manually. When providing a language code manually, be sure to enter a standardized language code, since this code may be used by browsers to determine an appropriate display language.
ca_es: Afegiu una llengua per a ser suportada pel vostre lloc. Si la llengua que voleu no està disponible al menú desplegable de <em>Nom de la llengua</em>, feu clic a <em>Llengua personalitzada</em> i proporcioneu un codi de llengua i d'altres detalls manualment. Quan proporcioneu un codi de llengua manualment, esteu segurs d'introduir un codi de llengua estandaritzat, ja que aquest pot ser utilitzat pels navegadors per a determinar una llengua de visualització apropiada.

source: Define how to decide which language is used to display content (text that you create and edit) and user interface text (text provided by Drupal and modules, such as field labels and help text). This decision is made by evaluating a series of detection methods for languages; the first detection method that gets a result will determine which language is used for that type of text. Define the order of evaluation of language detection methods on this page.
ca_es: Definiu com es decideix quina llengua s'utilitza per a mostrar el contingut (el text que creeu i editeu) i el text de la interfície d'usuari (el text proporcionat pel Drupal i els mòduls, com per exemple, les etiquetes dels camps i el text d'ajuda). Aquesta decisió es duu a terme avaluant una sèrie de mètodes de detecció per les llengües; el primer mètode de detecció que obtingui un resultat determinarà quina llengua s'utilitzarà per aquest tipus de text. Definiu en aquesta pàgina l'ordre d'avaluació dels mètodes de detecció de llengua.

source: Determine the language from a request/session parameter. Example: "http://example.com?language=de" sets language to German based on the use of "de" within the "language" parameter.
ca_es: Determina la llengua a partir d'un paràmetre de la petició/sessió. Exemple: "http://example.com?language=de" estableix la llengua a Alemany basant-se en l'ús de "de" al paràmetre "language".

source: See the <a href="@languages">Languages page</a> for more information on adding support for additional languages.
ca_es: Consulteu la <a href="@languages">pàgina de llengües</a> per a més informació sobre com afegir suport per a d'altres llengües addicionals.

source: This page imports the translated strings contained in an individual Gettext Portable Object (<em>.po</em>) file. Normally distributed as part of a translation package (each translation package may contain several <em>.po</em> files), a <em>.po</em> file may need to be imported after offline editing in a Gettext translation editor. Importing an individual <em>.po</em> file may be a lengthy process.
ca_es: Aquesta pàgina importa les cadenes traduïdes que hi ha en un arxiu Gettext Portable Object (<em>.po</em>). Tot i que es distribueixen normalment com a part d'un paquet de traducció (cada paquet de traducció pot contenir diversos arxius <em>.po</em>), un arxiu <em>.po</em> pot necessitar ser importat després d'una edició en un editor Gettext. Importar un sol arxiu <em>.po</em> pot ser un procés molt lent.

source: This page allows a translator to search for specific translated and untranslated strings, and is used when creating or editing translations. (Note: For translation tasks involving many strings, it may be more convenient to <a href="@export">export</a> strings for offline editing in a desktop Gettext translation editor.) Searches may be limited to strings found within a specific text group or in a specific language.
ca_es: Aquesta pàgina permet que el traductor cerqui cadenes específiques traduïdes o sense traduir i s'utilitza a l'hora de crear o editar traduccions. (Nota: Per a traduccions que afectin moltes cadenes, pot ser més convenient <a href="@export">exportar</a> les cadenes i editar-les a part en un editor Gettext). Les cerques haurien de limitar-se a cadenes dintre d'un grup de text o en una llengua concreta.

source: Administer languages
ca_es: Administra les llengües

source: Translate interface texts
ca_es: Tradueix els texts de la interfície

source: Content language detection
ca_es: Detecció de l'idioma del contingut

source: Order of language detection methods for content. If a version of content is available in the detected language, it will be displayed.
ca_es: Ordre dels mètodes de detecció de la llengua per al contingut. Si una versió del contingut està disponible en la llengua detectada, es mostrarà.

source: User interface text language detection
ca_es: Detecció de l'idioma del text de la interfície d'usuari

source: Order of language detection methods for user interface text. If a translation of user interface text is available in the detected language, it will be displayed.
ca_es: Ordre dels mètodes de detecció de la llengua per al text de la interfície d'usuari. Si una traducció del text de la interfície d'usuari està disponible en la llengua detectada, es mostrarà.

source: Determine the language from the URL (Path prefix or domain).
ca_es: Determina la llengua a partir de la URL (Prefix del camí o domini).

source: Determine the language from a request/session parameter.
ca_es: Determina la llengua a partir d'un paràmetre de la petició/sessió.

source: Follow the user's language preference.
ca_es: Segueix la preferència de llengua de l'usuari.

source: Determine the language from the browser's language settings.
ca_es: Determina la llengua a partir dels paràmetres de llengua del navegador.

source: Use the detected content language.
ca_es: Utilitza la llengua detectada del contingut.

source: Language switcher (@type)
ca_es: Commutador de llengua (@type)

source: Detection and selection
ca_es: Detecció i selecció

source: URL language detection configuration
ca_es: Configuració de detecció de la llengua via URL

source: Session language detection configuration
ca_es: Configuració de la detecció de llengua per sessió

source: Localize
ca_es: Localitza

source: Localize date formats
ca_es: Localitza els formats de data

source: Reset date formats
ca_es: Restableix els formats de data

source: Reset localized date formats to global defaults
ca_es: Restabliu els formats de data de llengua als predeterminats globals

source: January
ca_es: Gener

source: February
ca_es: Febrer

source: March
ca_es: Març

source: April
ca_es: Abril

source: June
ca_es: Juny

source: July
ca_es: Juliol

source: August
ca_es: Agost

source: September
ca_es: Setembre

source: October
ca_es: Octubre

source: November
ca_es: Novembre

source: December
ca_es: Desembre

source: add link
ca_es: afegeix un enllaç

source: There are no menu links yet. <a href="@link">Add link</a>.
ca_es: No hi ha enllaços de menú encara. <a href="@link">Afegeix-ne un</a>.

source: The text to be used for this link in the menu.
ca_es: El text que s'utilitzarà al menú per aquest enllaç.

source: The path for this menu link. This can be an internal Drupal path such as %add-node or an external URL such as %drupal. Enter %front to link to the front page.
ca_es: El camí per aquest enllaç de menú. Pot ser un camí intern del Drupal com %add-node o una URL externa com %drupal. Introduïu %front per a enllaçar a la portada.

source: The description displayed when hovering over a menu link.
ca_es: La descripció que es mostra al passar per damunt d'un enllaç del menú.

source: Menu links that are not enabled will not be listed in any menu.
ca_es: Els enllaços de menú que no estiguin habilitats no es llistaran a cap menú.

source: Show as expanded
ca_es: Mostra'l ampliat

source: If selected and this menu link has children, the menu will always appear expanded.
ca_es: Si se selecciona i aquest enllaç de menú té fills, el menú apareixerà sempre ampliat.

source: Parent link
ca_es: Enllaç pare

source: The maximum depth for a link and all its children is fixed at !maxdepth. Some menu links may not be available as parents if selecting them would exceed this limit.
ca_es: La màxima profunditat per a un enllaç i tots els seus fills està fixada a !maxdepth. Alguns enllaços de menú poden no estar disponibles com a pares si la seva selecció pot excedir el límit.

source: Optional. In the menu, the heavier links will sink and the lighter links will be positioned nearer the top.
ca_es: Opcional. En un menú, els enllaços més pesats s'enfonsaran i els més lleugers es posicionaran aprop de la part de dalt.

source: This text will be used to construct the URL for the menu. The name must contain only lowercase letters, numbers and hyphens, and must be unique.
ca_es: Aquest text s'utilitzarà per a construir la URL pel menú. El nom pot contenir només lletres en minúscula, números, guions i ha de ser únic.

source: Are you sure you want to delete the custom menu link %item?
ca_es: Esteu segur de voler eliminar l'enllaç personalitzat de menú %item?

source: The menu link %title has been deleted.
ca_es: S'ha suprimit l'enllaç de menú %title.

source: Are you sure you want to reset the link %item to its default values?
ca_es: Esteu segur de voler restablir l'enllaç %item als seus valors predeterminats?

source: The menu link was reset to its default settings.
ca_es: S'ha restablert l'enllaç de menú als seus paràmetres predeterminats.

source: No Main links
ca_es: No hi ha enllaços principals

source: Source for the Main links
ca_es: Font dels enllaços principals

source: Select what should be displayed as the Main links (typically at the top of the page).
ca_es: Seleccioneu el que ha de mostrar-se com a enllaços principals (normalment a la part superior de la pàgina).

source: No Secondary links
ca_es: No hi ha enllaços secundaris

source: Source for the Secondary links
ca_es: Font dels enllaços secundaris

source: Select the source for the Secondary links. An advanced option allows you to use the same source for both Main links (currently %main) and Secondary links: if your source menu has two levels of hierarchy, the top level menu links will appear in the Main links, and the children of the active link will appear in the Secondary links.
ca_es: Seleccioneu la font per als enllaços secundaris. Una opció avançada us permet d'utilitzar la mateixa font per als enllaços primaris (actualment %main) i els secundaris: si la vostra font del menú té dos nivells a la jerarquia, els enllaços de menú del nivell superior apareixeran com a enllaços principals i els fills de l'enllaç actiu, apareixeran com a enllaços secundaris.

source: Deleted custom menu %title and all its menu links.
ca_es: S'ha suprimit el menú personalitzat %title i tots els seus enllaços de menú.

source: Deleted menu link %title.
ca_es: S'ha suprimit l'enllaç de menú %title.

source: <strong>Warning:</strong> There is currently 1 menu link in %title. It will be deleted (system-defined items will be reset).
ca_es: <strong>Avís:</strong> Actualment hi ha 1 enllaç de menú a %title. Aquest se suprimirà (els elements definits pel sistema es restabliran).

source: The Menu module provides an interface for managing menus. A menu is a hierarchical collection of links, which can be within or external to the site, generally used for navigation. Each menu is rendered in a block that can be enabled and positioned through the <a href="@blocks"">Blocks administration page</a>. You can view and manage menus on the <a href="@menus">Menus administration page</a>. For more information, see the online handbook entry for the <a href="@menu">Menu module</a>.
ca_es: El mòdul Menu proporciona una interfície per gestionar els menús. Un menú es una col·lecció jeràrquica d'enllaços, que poden ser tan interiors com exteriors al lloc,utilitzats generalment per a la navegació. Cada menú és representat per un bloc que pot ser habilitat i posicionat a través de la <a href="@blocks">pàgina d'administració dels blocs</a>. Podeu veure i gestionar els menús des de la <a href="@menus">pàgina d'administració de menús</a>. Per a més informació, aneu a la secció del <a href="@menu">mòdul Menu</a> del manual en línia.

source: Managing menus
ca_es: Gestió de menús

source: Users with the <em>Administer menus and menu items</em> permission can add, edit and delete custom menus on the <a href="@menu">Menus administration page</a>. Custom menus can be special site menus, menus of external links, or any combination of internal and external links. You may create an unlimited number of additional menus, each of which will automatically have an associated block. By selecting <em>list links</em>, you can add, edit, or delete links for a given menu. The links listing page provides a drag-and-drop interface for controlling the order of links, and creating a hierarchy within the menu.
ca_es: Els usuaris amb el permís <em>Administra menús i elements de menú</em> poden afegir, editar i suprimir menús personalitzats a la <a href="@menu">pàgina d'administració de menús</a>. Els menú personalitzats poden ser menús especials del lloc, menús d'enllaços externs o qualsevol combinació d'enllaços interns i externs. Podeu crear un nombre il·limitat de menús addicionals, cadascun dels quals tindrà un bloc associat de forma automàtica. Seleccionant <em>llista els enllaços</em>, podeu afegir, editar o suprimir enllaços del menú en qüestió. La pàgina de llistat d'enllaços proporciona una interfície d'arrossegar-i-deixar-anar per controlar l'ordre del enllaços i crear jerarquies dins del menú.

source: Displaying menus
ca_es: Mostra els menús

source: After you have created a menu, you must enable and position the associated block on the <a href="@blocks">Blocks administration page</a>.
ca_es: Una vegada hàgiu creat un menú, heu d'habilitar i posicionar el bloc associat a la <a href="@blocks">pàgina d'administració de blocs</a>.

source: You can enable the newly-created block for this menu on the <a href="@blocks">Blocks administration page</a>.
ca_es: Podeu habilitar el bloc que acabeu de crear per aquest menú a la <a href="@blocks">pàgina d'administració dels blocs</a>.

source: Each menu has a corresponding block that is managed on the <a href="@blocks">Blocks administration page</a>.
ca_es: Cada menú té un bloc associat que es pot gestionar a la <a href="@blocks">pàgina d'administració de blocs</a>.

source: Administer menus and menu items
ca_es: Administra els menús i els elements de menú

source: Provide a menu link
ca_es: Proporciona un enllaç de menú

source: Menu links with smaller weights are displayed before links with larger weights.
ca_es: Els enllaços de menú amb un pes inferior es mostren abans que els enllaços amb un pes superior.

source: Available menus
ca_es: Menús disponibles

source: The menus available to place links in for this content type.
ca_es: Els menús disponibles per a afegir-hi enllaços per aquest tipus de contingut.

source: Default parent item
ca_es: Element pare predeterminat

source: Choose the menu item to be the default parent for a new link in the content authoring form.
ca_es: Escolliu l'element de menú que serà el pare predeterminat per a un enllaç nou en el formulari de creació de continguts.

source: Add new menus to your site, edit existing menus, and rename and reorganize menu links.
ca_es: Afegiu nous menús al vostre lloc, editeu-ne d'existents i reanomeneu-ne i reorganitzeu-ne els seus enllaços.

source: Parent menu items
ca_es: Elements del menú pare

source: Edit menu link
ca_es: Edita l'enllaç de menú

source: Reset menu link
ca_es: Restableix l'enllaç de menú

source: Delete menu link
ca_es: Suprimeix l'enllaç de menú

source: The <em>Navigation</em> menu contains links intended for site visitors. Links are added to the <em>Navigation</em> menu automatically by some modules.
ca_es: El menú de <em>Navegació</em> conté enllaços destinats als visitants del lloc. Els enllaços al menú de <em>Navegació</em> són afegits automàticament per alguns mòduls.

source: The <em>User</em> menu contains links related to the user's account, as well as the 'Log out' link.
ca_es: El menú d'<em>Usuari</em> conté els enllaços relacionats al compte d'usuari, a més a més, de l'enllaç de 'Sortir'.

source: The <em>Management</em> menu contains links for administrative tasks.
ca_es: El menú de <em>Gestió</em> conté enllaços de tasques administratives.

source: The <em>Main</em> menu is used on many sites to show the major sections of the site, often in a top navigation bar.
ca_es: El menú <em>Principal</em> s'utilitza a la majoria dels llocs per a mostrar les seccions principals del lloc, sovint a una barra de navegació superior.

source: The <em>Secondary</em> menu is used on many sites for legal notices and contact pages.
ca_es: El menú <em>Secundari</em> s'utilitza a molts llocs per avisos legals i pàgines de contacte.

source: manage display
ca_es: gestiona la presentació

source: No content types available. <a href="@link">Add content type</a>.
ca_es: No hi ha tipus de contingut disponibles. <a href="@link">Afegiu-ne un</a>.

source: The human-readable name of this content type. This text will be displayed as part of the list on the <em>Add new content</em> page. It is recommended that this name begin with a capital letter and contain only letters, numbers, and spaces. This name must be unique.
ca_es: El nom llegible-per-humans d'aquest tipus de contingut. Aquest text es mostrarà com a part del llistat a la pàgina de <em>creació de contingut</em>. Es recomana que aquest nom comenci amb majúscula i només contingui lletres, números i espais en blanc. Aquest nom ha de ser únic.

source: Machine name: @name
ca_es: Nom de màquina: @name

source: The machine-readable name of this content type. This text will be used for constructing the URL of the <em>add new content</em> page for this content type. This name must contain only lowercase letters, numbers, and underscores. Underscores will be converted into hyphens when constructing the URL of the <em>add new content</em> page. This name must be unique.
ca_es: El nom llegible-per-la-màquina d'aquest tipus de contingut. Aquest text s'utilitzarà per construir l'URL d'aquest tipus de contingut de la pàgina de <em>creació de contingut</em>. Aquest nom només pot contenir minúscules, números i guions baixos. Els guions baixos es convertiran en guions quan es construeixi l'URL de la pàgina de <em>creació de contingut</em>. Aquest nom ha de ser únic.

source: Describe this content type. The text will be displayed on the <em>Add new content</em> page.
ca_es: Descriviu aquest tipus de contingut. El text es mostrarà a la pàgina de <em>creació de contingut</em>.

source: To remove the body field, remove text and leave blank.
ca_es: Per a eliminar el camp cos, elimineu el text i deixeu-lo en blanc.

source: Preview before submitting
ca_es: Previsualitza abans d'enviar

source: This text will be displayed at the top of the page when creating or editing content of this type.
ca_es: Aquest text es mostrarà a la part superior de la pàgina quan es creï o s'editi contingut d'aquest tipus.

source: Users with the <em>Administer content</em> permission will be able to override these options.
ca_es: Els usuaris amb el permís <em>Administra el contingut</em> poden sobreescriure aquestes opcions.

source: Display author and date information.
ca_es: Mostra la informació de l'autor i la data.

source: Author username and publish date will be displayed.
ca_es: Es mostrarà el nom d'usuari de l'autor i la data de publicació.

source: Length of trimmed content
ca_es: Llargada del contingut retallat

source: Invalid machine-readable name. Enter a name other than %invalid.
ca_es: Nom llegible-per-la-màquina no vàlid. Introduïu un nom diferent a %invalid.

source: %type is used by 1 piece of content on your site. If you remove this content type, you will not be able to edit the %type content and it may not display correctly.
ca_es: %type és utilitzat per 1 element de contingut del vostre lloc. Si esborreu aquest tipus de contingut, no podreu editar el contingut %type i aquest no es mostrarà correctament.

source: Publish selected content
ca_es: Publica el contingut seleccionat

source: Unpublish selected content
ca_es: Retira el contingut seleccionat

source: Promote selected content to front page
ca_es: Promou el contingut seleccionat a la portada

source: Demote selected content from front page
ca_es: Degrada el contingut seleccionat de la portada

source: Make selected content sticky
ca_es: Fes el contingut seleccionat estàtic

source: Make selected content not sticky
ca_es: Fes el contingut seleccionat no estàtic

source: Delete selected content
ca_es: Suprimeix el contingut seleccionat

source: <em>and</em> where <strong>%type</strong> is <strong>%value</strong>
ca_es: <em>i</em> on <strong>%type</strong> és <strong>%value</strong>

source: <strong>%type</strong> is <strong>%value</strong>
ca_es: <strong>%type</strong> és <strong>%value</strong>

source: Deleted @count posts.
ca_es: S'han suprimit @count entrades.
